node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7349129
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "O\343?\275\3201\266\275\322\307?=\315\262\350=k\350\227\276\021\361\033>\204\001\377\275\372o\377\275\2530\262\274]\266\331\275]\t\275=A7\017\276z\032\203\274\tb\021\276\306\200\017=U\024~=\273\037\376\275\000H\237\274\251\233\342\275-uH\275@\270\206\276Z\3200>@\322S\275\255\211\245\275\247-\244\275d\201\244=\261\003\363\275\257G\005\275\360\202W=\376l\211>\365\357\033>qy\315\275\201\245\233\273?\310\027=\333:L\275]\207\254=\036\320\030>\242\320\013=.\314\027>\306\371\016\275\"J\344\275Y\276\232\275\3529=\276\334\336\331\274\256\016\212=\257\307\222\275VRl\274\343\312\340=\221\321i>_L\331\275i4$>;3\324=\216\006c=r\251\211\276\014\353\035\273\363\332G\276\241\"\276\275|\303\247\276\265}A=;o,>A\230\212> H\237\2752d\004>+\255\023\276\352C\310=k-B>\2563\205\275q\2210>\332m\204\275z\3730\275.\310\246\273\304\010\207>1\034C\275\345\226\214=\234\367\306>\3765\363\275\275vK\275\342\377\225\275E\370\345\275\355\233\344=\304-@\276\326\261)\275S\006C=W\023\233\275\217\357\273\274\310z)\275(@\014\275\216Dh\275\302\326!\276\240\366\272<Z\333\234\275\353\250\250=\313b\325<\301F\n>s \260\275\025\346\000\275\203\031\215>\244\037\026=*\3758>\336\021\003>py\251=>5%\272&\210d\276\374\265\372\274\313\315]\275\034\345\000\276\242\2512\276yY-=\352\222\366\275,\265\221>\320\rq\274\303bi\273$\t^:(QJ>mf\366=\330\310\246\275]o\355\275 \270\024=\356\322\276\273\2430\262<\021\367F;\007\030j=\271\303\020=\242\021,=h\336\010\276-b\220<4\013\233\275E\373==\214\034\302=wG\262\275\342\'\035=\010\227\347=\276q\373=\231\244S\275\367(\n\275=\326\000>\025\352\226=v,\246=\210qr\274\276\352\026>\313\323R>\2265\325\275xK\330\275\275\240y\276>\024\326\274C\354\360\275q\323\372\274\332\024\235\275\221_g>0\206a\274\227)E>\331_\264<\313\235\023\275\366\260\021\275=\343\220\276\374p\213>\227j\275>\361X3\276\235\343[\276\352\037\265<U\235\351=\273eA>:\340\325=Q\331|\276B`w\275/p\223=\261~\215\275\356\265\'\275\340\321\206\274\024\372\214\275YB\216\273{\177.\275\376L0=v\"\260:\326^\221\275\301wp\275k\250\333\274\311\202L>\035|.\276?RN>\213\260\205;\030\t\277\275\232T3\2753s\033\275D\211\223\276\275\033\216\2769\225\257=\321\027\237\274E\226\014\276\312\206\377=\271\236\264\275S`\242\275\023~b=\251%2>\322\324L>\232\207\332\275-\266\013\275\234\300\027\275\254\337K>\211\273\022\275t\016F>#\263\206=\205\366\264\275\222\376\016\275\337\304*>53\332<\nv\027\275\026\035\326=\242\233u\276\376\373i=W!b>\274\206\026>\030\347\002\275\007gm\273\330\033\037>\361y\034\275\302\232\301=D\250\220\276\374\273\364<\343\245}\276\241\265\323=\032\"`;\006\020\025\275P\302\\\275\013\373\323=\000\227\\\276\'!\222<\302\306\031>,{\347\275\236\277\213\275\315g*>\200\246\032\276s\243*=`:\033>\272\217\215\275}5\373=\000\200\006\276\266\321\315\275\275O\000\2745@\272={\256 \275\243G\311<\363q\026>\257\247\'\274b\346\002=\023n\347\275\371\343\337\275\035\307>\276L\335\t>\016\001\010\276\315\220U\273\342\230\314=\014DL>}Y\301<\315\377\232\275(\343\022\276\321\343\034\276\257\300\325=\004\212\034\274\225\267+\273\266\255\n\276\033}\022<\255\177\243<\337..>\363\340\236=\027!\277\275\375\212Z\275\2248\303;-\314\236=-\346\340=>i\021\276b\014\377=\322\021\346\274\236\',=\336)\242<z4-\276\351\366g=,\365\251\275\253,%\276\240w\330=\022\027\221<A \240>5\265\303=\035k\014>\3119\214>\233\244h:\347\005;>L\237\016>N\353\353;\354^\357\275O\016Q=\272v\300\274X^\237>S\254\356=P\367y>\034\250n\276\242rb\276\213\251\302=T\351\225=\274-\345\275\306u\n\276$=u;\331\236;=\031/a\275\333p\177=\364\177\205\2755\330u\276\351;\247\275\325r\021\275%K\215>\310q\230\275\355\347\031>n\261\243\276\245\006\334=\016\300\210;\254\222a>x\\\006>]\0217\276\241\367\305\273cu\235\275i\354\250=\371\230}\276uq =\343\005\'\275\227>N\276)\374\271=+[\017>\275\206\211=\264l\177\275\370\355Z>\360bj\276%!\302\274\326C\022\276:Z\014\275\017e\223\275k\021K\274\0235\366\274O\\A\276\301T\275\274>7\030>Vn\200\276\272#\240=\332h\265= \362\017\276\360\205\214\275W\022X\275\017\355\252\275k\336T>H\213\322\274#\354\256;\017\331\202=\030v\272\275\360\300m>\2515\237\275\021\2524\275}\362\250\273\302s\026\275-\376\003\276\326,u\274\320\\\343\274\022\001\261\275\256\337y>!r\352=\t\320[\276w\203\312=\245\361\014\276\367\006\307<M\370\257\275\226w\005\276\207\363\006\275\311\235\007>a\013\373<D\274\313;q\374\270=f\032\362=K,\201\276\376P\277=7A8>P\001\223>\r\000\203\275F$\300\274\324\004B>\r5.\275\272w\017\274\217\377\213\275SSx=\334\251\005\276\331U&\276\371\207\013=\333\002@=\343\200\254\275\276\336U\276\237\354-\2720\320\022=pt\221\275\034,\000=m\277\n\274\241\360\221=hrn>po\262\274\335\352\000\275\314\340\352\275\261\232s\273Ds+\276\355\005:\274\265\221\244\274C-\336\275=\357\376<So@=Zc\243\275\303h/=\016M!\276\r\321\000>\t\030\240\276uE\366\275\203b\';{\362\325\275P\346\272>\271\354\376\274\237B\337\275+\352\332=\001\330\257\275P\305\317\275\331\235\322\275\331E%\276\353\277\232=\300w \276\024\201\034\276\371\342\333=\375\376\025\275\263\354\245=\365n\322\275v\361>>\305\340\270\275\266\033!\275\211\245\200\275\004h\251=\230f\264=\321\207\004=\214u\222\275uF\233=50\332<\302E\204\275u\265\004\276\227\355\242>g;\313\275\330\020\210\275M\305\311\275\226\356<\276\214\262G\275\311\356\342\275\346\2108\276\300f\"\274\007\320.\276\251#\276\275\267E\361\274\347\200*\275\233\355\364\27189\024\276u*B=H%k\276\220\304\207\275l\367\322\274\367\235\361\275&\177,\275\271\\@\275\352\231~\276\367\213\020\274\324#/>.\314R>|O\035>E\311\212=f\221;>\233\372s>*\217\320\274K\340{<\337\302W>=O\206\275\203\214E\275Ph\245\276\002Rv\273\345Z\210=\014\2242>\246\t\300=\'\327\276\273\357A\033>u\000%>F\247\001\275\320\006\027\275\n\336\026\275I\320\264>v\276\026>\314=\370\275\303\337i>\236\250\317\275i]\2039\344\222)\276_\343\237\276\020g\360\2759a_=Q-)>Z\351\227\275\022\255\t\276\002\351\367\2746\332\332=\313\207\241\2754(k\276;\235(<\221\362q=\247\037\324<\264WX=\356\263\'\276\227\300!>\320?\235\2739\324?>\300\273?>_)\003\276\263\302O=\030q\313\274E\345\241\275<\036\377\275>[o\2742~\216=\331\314Y=6M\255=tS\236\275w\372\021\276ecc\275\177\342\225\276!\233Y\275Z\2004>C\020\230\275\375\221\310=\347\025#\273\374\006\031>p\313\315\275\355\241\026>\242\327C=l\r\314=}\312\263<S\212\324=\256\367S>ix\341=D\213|>\330\362\002\276\2217E>\316\313b\274\205\315\017\274\017C\036\276\253\343\324\275\034\307\333\274\324\2750\275\004J\212=\"\266\235\275\271\205\013\276f\243\200>z\354$\276\3652\243=\265\331\372;\224t?\274\262\307\217\275\352\034\007<\335\030\024\276\022\204\">\320\214]\272\352\t\364\275\323\336\030\275\0274Y\275]K\037\2765\345!\274\263G\021\276NB\204=\325_\250\276M\262$\276\303\200\343=Q\220\177\275AI&\275\225\331i\275N0\034>\376^k=\215j\316\275\366\306\210=@J\210\274\242\304\356=j4\220\276\211\034\351\275\314\233\230\275=0_<V\002\215<\361H\263\275\351\360\214=\326\"\230\276\372]/\276o\374\330=\200 \327\274\014\221;=,\311\020\276|\372:>Nc:\276l\033\322<O\022\271=\304;\333<n\264\377:D\010\216<\023\031[\276W\3026>\361\343\'\276\276\244\252<]\0215>OLI>0-\356<\323\340\333=\014\"b=E\265U>\257\003\304\274\372\326\022\276\230\371\336=F\t\354\275\266\207\211>?\205\371\275@\375b\275\220\256\021=\300\340\236\275b\243\334=\351\273y=\233\351\207>\027Kg=\302\337>=\006`\014\276J\327\372;4\027b\272\207m|<\037\360\371\275\014\275\003>\334\330\212=uw$>\211L|:\3054\252>\262\260\346\274L\235\036>\234w\200\275\007qO\275;\367\211>E!\332\274\005Z\323=\355Ph=\330\337\005=\244\325+\275\'7\016>\234\327\315\275\322\315u\275\"\204\242=\3059\336\275\312\207_>\024u\356\274L|\353\275\350\005\243\274\210\320\307=\271\342\202\275\0369\223>\361[9\275\335\341\211=\315\305\206\276\276}\302=\321\251l\276qI\016\276\031n\270<X \"\276A\306\r\275\332\322\024\275\005\343\274=\313\346b>-*\020=\003+\021>\240\376B>\314\365e>\202\226\256\275\364\372\244=\024%k<\340\027\027>L}\311\275u\321*<S\333\372<0.\222\275j\005c\276\036z\255=\204\314\364=_\021\007\276``\025\276Z\201\227\275\021x\231\275r\017?\275\253s\214>d\231\213<\374U\375=\021\334K>\344\017\033>`B\262=\207$\335\275\215\265^=@\033j\274)\227\332\274f\321\307=/\231\312=\014\345C\276A\232\360\274\'\216\001>\217\362\022\276*\275\003>\005\202\300\275\263\275c=\231\014\327\272\227\004c<\267\203\356<\207\201(>\313\262A>\356\376\360\275\021\037i<cR2>\031n\205\276\337\275)>\034\rl<\373\031\330=\346\336\253=}A6\276\227J(\276\321h1>\3579\363=ee\341=Rl>>\271\322\271=\304\245\000\276l\331\306\275\t4\017>\220u\211\275*\271\232=\261\224\317\275\245\344_=h\271\343\275#]\003\276;\247t\276\221/\311\275\223E\021>X\340\003>-)\254=C\331\253>2\3036\276\225\235\302=}\371\361\273\310\204\034=\036\375\335=\314\006\214<\272\365\257\275\341\t\303=\246\361\325\276\264\334\254\274>1N\275\244Ir=\234du\276{\357\373\275\327J\244=\336\272\240=\364\212\324\274\265\231\341<\344O\343\275E\033|<\356\023$\276\243v\223\275\017+\365\274\360$\300=)\202\004\274\276\325\016\276H\201\033;\313\203\243\275|%\211<V\317\247<\032\340\215\275\323W\240=V>V=\024[W\276\334i\222\275\365L\370=\356\310;>66\353\273hLU:C\253s=u\346\344\275z)\256\274\022\026w=A\265T=\3376\363\274\347s0\275_\324\277\275c\310\221=\201\363\027>G\302\200\274!\356\216=\212Y\207>\375#T=\205\355\024\276\317\277\314\275\211\331T\276\000\235\225\276\013\200\213\275\2151\002=\237\3276=\311\256\232<\356\200\240\275\'\014G\276\213\221z\2739\352\356=\211\201\215\275\251\311\007>\375\021\325\275\204=\177>\333\267\364\2755\330\266=,\361W\274\341<\025\275\356\'U\275\204\222<>\303m\212>q\230\271=\205\265\255= *\223\275PHV>\321\344\221=8m\001\276\353\234\013\274Y\037q>e\314\030;\324\322=\276e\304\227\275\216AQ\276\352\334#;\223\313X\276\252ss>m8/\276\311\323I<\375\307\260:\273W->\277\303s=Y\222\216>\343ow;Tl\272\275\371\300\214\275\255\220\311\275r\277\021\276u_[>?U\341\275o\346\306\275 v\">*\266D\276Rf\024=\021r\267\273/\241\013>A\372X=\367\310\315\275\264s\n>\266\340\276\275Ec\275<MwD<c\365\251=\327H\225>\253\252\302\275\235\000\014\276Q\300B\276\320\271\260=\256\007k=2l\032\276\334L\346\275\237\230\202\276\3565\024>r \035\2752\007\312<\353\370Y\275y_\353<\006\267\323\274\260\354\210;!\350\361\275}\236Z>\202C\305<P\204X\276\005y\331\275\236\365t=\221\375\271\275F^\217=\'\263s\276\374\231\025>b\307u\275x\230:\275~Dy=c\322\324=\2024\276=d\273\312\275\217\337[>\031\013|;/F\036\276+SI\276u\376\216=\241\021I>qW\333\275\257\264O=\331P\200\274\365Ok<\251\234.\276\353\234;>\243\010a\274\221\276\250\276\037<$\274F\003\216\275Kkw=\ng*\275W\322$=S\346e=:\202\021<\177\353\225\275\202JY>\253\244\203\275|\014\013\276\274U\262\274\023\034\354=\342\314$\276\302\261H>eM\376\275\022C\367\271\314\032W\275\215\351C>6|`=\255\334\373<\005\216_\275\253\242\331\275R\354\317\275\016\017\253\276#}\265\275n\020.<\3650o>\036\313\207=\303nZ\274\034\220O>\000\034\304\274?\016\017=_\357p>wP\216\275\250?\370<X:\000\276\005{,\274\002 M:\272u\351\275\236\305\266\275q\260}:\341\007\225>\032\3677\275v\206D=\352i\224\275\276\352\177\275M\231\213>q \007\275 \2418>\314\215\246<\304\020\007>\225\331\347<t\267\365\275\243\033\'>X54>\332\233\214\275\3144n=\333\020\211\276#\027\235\275a\357F>\347\002\216=A\033\222=\t\2044\275\357\335\026\275\001r\225<!\243d>\330\013t\274s\225\203\274\325\216\342=\356H\212=j\025\026=\337\362\201>\310\260\314\275\355ZY\275\242\361\263=u\205P\274A\\h>\371\364\227=\222\212/\275\322+\025\275rk >dK\251\276_p\253\275,\333\215>\r+\311\275\342\340\002\276u\033I=\021\005\227<+\216\247\273\005x\027\276\207\223\323\274?.F>\002\255\337\275_\334@>\323#z;@\231\313\275\3129\t<VE&>\205\363\203=\314\200\014>\271\\\014\276Q\274\251=W\326n=#\"\260\273\355j&>:\220\240\275sK*>\n\022\'>\010\013\004\276X\313\355=\221\2562\276\321\242\316\274\232\365\266=\354\311;>\333\315\244=[\017\345<\323\336\010\276g\316\033\276\005A\226\275U#\215=\323\322\354=d\250@>D{\265=\214\336\205\275&\232\236\275\360_\200\276%~\210=+L\003\276\237B \276B@\360=XJC=\023R\313<\016\330\237\274\010\017\224>T\311\316\275\220w\305=\2745\000\274:\002\252\275\361\032=\274^9y=\010\014\205=)\206\360<\036\344/>\244=\243=\333\204E\276 j\326\275\3468\312=\227\273\014\276\354G\260<\313\030)\276\017S\307=\215\344\030\276\277\337J>\316\237\246=F^X\276\325\t\326\275\336\264\023>\022/\252=\337\324\231=\315\026\351=\217\275C>\343QE<+`5\276\206\030\024>\217\177\230\276\313\234\016\276\375\263\305=\201\326\216\273\013\272\310\275N;\027\276\320\327\372=\002B\001=^$\335<\202\037\224\275\024\325<>*\2653\275\352c\310\275\034\271e\276\002\204\027\273\304\202\347\2758\316\000>\371\250E\276]\016\330=\237H;>S\216N\275XA2>P2\331\275\234N\313\275\363\311\253=%l`>\313\220\273\275\226m\371\274\nx:>\333\311\243\276i:\375<\\7g>\275\035\203=X&\350=\377 H<pq\310\274\223\223\366\273\005VB\275\017\274\036=\177\232\206\2763\364\241\275M\276\035\276D\254\334;l\352M;5\224\307=bL\231=\334\\\202\273\033\231\227;\264\325\266=\2564\246=\341\353\026>\243|\r\276x\357\004>\230`\206\2768\212\223\275\207&\006>\037m\177=%\360\252\275!\234\017\275\021\271|=\203\261\247\276\301\310\300\275\366|\010\276{\2376\273\366\237!=\275\n\376=nH0=\357\237/>\316\014N\274\005\244\316\274\240\272\n>\310\327\003=\365\201\243\276\336E\323\275\361\006\021=Qg\016\276\r\0148\276\005\001f=[H\352\275F\203\273\275\374\366\263\275\362\247\016\276\241\252U\276\334\233\013\274\234\262\005;{r\322=9R\377=V[\021=\010\263_\273\234\374\255\275\003d\033=\232^k>u}\260<^h\216=y\016i\276\237o\270>\244q]=.:\006\274\016\275\033\274\271|i\275d\255\207\275\303!|=v?\341\274\362t\223\275\006\252l\275\320t\326\273\324%P>\315\264\372<,\347\204\275_\240\360<+\346\001>l_>\274*\037R\276\355\336\253\275\361wa\275\024\336w\276\365\355C;\022\352\362=\311\222\214\276\272\303L\275\355\300E>\231\361I>\217\003\031>F\005\230=;X\242\273\310\177\010\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
